Revit 2026 API

# IEntryPoint Interface

---

The interface supporting Document and Application level entry point classes for macros.

**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public interface IEntryPoint
```
```vb
Public Interface IEntryPoint
```
```cpp
public interface class IEntryPoint
```
```fsharp
type IEntryPoint = interface end
```

The IEntryPoint type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AddinFolder |  |

|  | Name | Description |
| --- | --- | --- |
|  | FinishInitialization |  |
|  | Initialize |  |
|  | OnShutdown |  |

#### Reference

Autodesk.Revit.DB.Macros Namespace